Revit 2026 API

# FaceToposolidSetFaceReferences Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFaceReferences(
	IList<Reference> faceReferences
)
```
```vb
Public Sub SetFaceReferences (
	faceReferences As IList(Of Reference)
)
```
```cpp
public:
void SetFaceReferences(
	IList<Reference^>^ faceReferences
)
```
```fsharp
member SetFaceReferences :
        faceReferences : IList<Reference> -> unit
```

#### Parameters

faceReferences IListReference

#### Reference

FaceToposolid Class

Autodesk.Revit.DB Namespace